name: "gpt4_nano"
backend: "python"
max_batch_size: 8

input [
  {
    name: "prompt"
    data_type: TYPE_STRING
    dims: [ 1 ]
  },
  {
    name: "max_tokens"
    data_type: TYPE_INT32
    dims: [ 1 ]
    optional: true
  },
  {
    name: "temperature"
    data_type: TYPE_FP32
    dims: [ 1 ]
    optional: true
  }
]

output [
  {
    name: "response"
    data_type: TYPE_STRING
    dims: [ 1 ]
  },
  {
    name: "tokens_used"
    data_type: TYPE_INT32
    dims: [ 1 ]
  }
]

# Model instance configuration
instance_group [
  {
    count: 2
    kind: KIND_CPU
  }
]

# Version policy
version_policy: { all { }}

# Dynamic batching configuration
dynamic_batching {
  preferred_batch_size: [ 4, 8 ]
  max_queue_delay_microseconds: 100
}